#include "le_be.h"

//大小端转换
/*******************************************************************************
**  函数名称:  get_le_word
**  功能描述:  获取小端数据 2字节
**  输入参数:  无
**  输出参数:  无
**  返回参数:  无
*******************************************************************************/
uint16_t get_le_word(uint8_t *msg)
{
    return (((((uint16_t)(msg[1])) << 8 ) & 0xFF00) | msg[0]);
}
/*******************************************************************************
**  函数名称:  get_le_dword
**  功能描述:  获取小端数据 4字节
**  输入参数:  无
**  输出参数:  无
**  返回参数:  无
*******************************************************************************/
uint32_t get_le_dword(uint8_t *msg)
{
    return (((((uint32_t)(msg[3])) << 24) & 0xFF000000) |
            ((((uint32_t)(msg[2])) << 16) & 0x00FF0000) |
            ((((uint32_t)(msg[1])) << 8 ) & 0x0000FF00) | msg[0]);
}
/*******************************************************************************
**  函数名称:  set_le_word
**  功能描述:  设置小端数据 2字节 
**  输入参数:  无
**  输出参数:  无
**  返回参数:  无
*******************************************************************************/
void set_le_word(uint8_t *msg, uint16_t value)
{
    msg[0] = (uint8_t)(value);
    msg[1] = (uint8_t)((value) >> 8);
}
/*******************************************************************************
**  函数名称:  set_le_dword
**  功能描述:  设置小端数据 4字节 
**  输入参数:  无
**  输出参数:  无
**  返回参数:  无
*******************************************************************************/
void set_le_dword(uint8_t *msg, uint32_t value)
{
    msg[0] = (uint8_t)(value);
    msg[1] = (uint8_t)((value) >> 8);
    msg[2] = (uint8_t)((value) >> 16);
    msg[3] = (uint8_t)((value) >> 24);
}
/*******************************************************************************
**  函数名称:  get_be_word
**  功能描述:  获取大端数据  2字节 
**  输入参数:  无
**  输出参数:  无
**  返回参数:  无
*******************************************************************************/
uint16_t get_be_word(uint8_t *msg)
{
    return (((((uint16_t)(msg[0])) << 8 ) & 0xFF00) | msg[1]);
}
/*******************************************************************************
**  函数名称:  get_be_dword
**  功能描述:  获取大端数据 4字节 
**  输入参数:  无
**  输出参数:  无
**  返回参数:  无
*******************************************************************************/
uint32_t get_be_dword(uint8_t *msg)
{
    return (((((uint32_t)(msg[0])) << 24) & 0xFF000000) |
            ((((uint32_t)(msg[1])) << 16) & 0x00FF0000) |
            ((((uint32_t)(msg[2])) << 8 ) & 0x0000FF00) | msg[3]);
}
/*******************************************************************************
**  函数名称:  set_be_word
**  功能描述:  设置大端数据 2字节 
**  输入参数:  无
**  输出参数:  无
**  返回参数:  无
*******************************************************************************/
void set_be_word(uint8_t *msg, uint16_t value)
{
    msg[1] = (uint8_t)(value);
    msg[0] = (uint8_t)((value) >> 8);
}
/*******************************************************************************
**  函数名称:  set_be_dword
**  功能描述:  设置大端数据 4字节 
**  输入参数:  无
**  输出参数:  无
**  返回参数:  无
*******************************************************************************/
void set_be_dword(uint8_t *msg, uint32_t value)
{
    msg[3] = (uint8_t)(value);
    msg[2] = (uint8_t)((value) >> 8);
    msg[1] = (uint8_t)((value) >> 16);
    msg[0] = (uint8_t)((value) >> 24);
}

