/*-----------------------------文件信息-----------------------------------------------------------------
**
** 文  件   名: PICOS.c
** 创建人:
** 日　期:
** 描　述: 任务调度程序
**------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
** 描　述: 调度结构优化，支持1ms~65535ms时间片
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
#include "picos.h"
#include "led.h"
#include <stddef.h>
#include "com_manage.h"

#define OS_MAX_TASKS 5  /* 最大任务数*/
#define MS 1            /* 系统时间单位，对应于OSTimeTick的调用周期  */

// 系统变量声明
// 定义系统时钟基准计时器
static uint32_t os_system_tick = 0;

/*********************************************************************************************************

**-------------------------------------------------------------------------------------------------------
********************************************************************************************************/


/************************用户可修改区**==**  用户程序相关区***************************/
// 任务栈初始化，定义每个任务和其时间片周期。
static _op_ Op[OS_MAX_TASKS] = 
{
        {0,     10*MS,      led_cw_dimmer_task},
        {0,     500*MS,     led_user_test},
        {0,     10*MS,      com_tx_task_10ms},
        {0,     10*MS,      com_rx_task_10ms},
        {0,     10*MS,      com_oam_task}
};
 // 任务的执行。
/*********************************************************************************************************
** 函数名称: os_start
** 功能描述: 此函数开始，根据时间片设定循环调用各个任务。
** 输　入:
** 输　出: 无
** 全局变量: 无
** 调用模块:
** 作　者:
** 日　期:
********************************************************************************************************/
void os_start(void)
{
    static uint8_t index;
    //os_system_tick = 0;
    do
    {
        for (index = 0; index < OS_MAX_TASKS; index++) // 查询是否有任务需要执行
        {
            if ((os_system_tick - Op[index].last_sys_tick) >= Op[index].TaskPeriod) // 查询任务周期是否到达
            {
                Op[index].last_sys_tick = os_system_tick;                      // 时间片重新赋值
                if(Op[index].TaskProc)
                {
                    Op[index].TaskProc();                                     // 调用任务
                }
            }
        }
    } while (1);
}


/*********************************************************************************************************
** 函数名称: os_time_tick
** 功能描述: 系统时钟函数，用于对各个任务时间片计时处理，定时中断调用，
                   此函数为所有任务的时间基准，调用时间与系统定义MS需要对应一致。
** 输　入:
** 输　出: 无
** 全局变量: 无
** 调用模块: 系统时钟中断服务调用
** 作　者:
** 日　期:
********************************************************************************************************/
void os_time_tick(void)
{
    os_system_tick++; // 系统基准累加计数
}
